Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetSizeInFloats
Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Returns:
The number of floats occupied by one vertex of this type.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
Sets the vertex's color.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetColor
Gets the vertex's color.
Returns:
The vertex's color.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
Constructs the vertex from a point and a color.
position:
The vertex's position.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
A geometry vertex specified as a position in space with a color.
Remarks:
The color of these vertices includes a transparency component
In order to render them as transparent they must be rendered in the transparent pass
See the 'IsTransparentPass' method of Autodesk.Revit.DB.DirectContext3D.DrawContext
Since:
2017